<a href="https://colab.research.google.com/github/lsGee/TIL/blob/master/01.Python/DS_%EC%8B%A4%EC%A0%84_Level_1_%EA%B0%95%EC%9D%98%EB%A1%9D.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

# 데이터 타입

## Series

In [ ]:
## list -> Series
## list 데이터는 판다스에서 조작 불가하므로 series 타입으로 바꿔줘야 한다
odd = [1, 3, 5, 7, 9]
pd_odd = pd.Series(odd)

pd_odd

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [ ]:
# 변수 타입 확인하기
type(pd_odd)

pandas.core.series.Series

In [ ]:
# 변수 내 데이터 타입 확인하기
pd_odd.dtypes

dtype('int64')

## DataFrame

In [ ]:
## 이중 list -> DataFrame
numbers = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
numbers = pd.DataFrame(numbers)
numbers

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
## DataFrame은 여러 개의 Series로 구성되어 있다
type(numbers[0])
# type(numbers.loc[0])

pandas.core.series.Series

## NaN (Not a Number)

`NaN` 이란 비어있음을 의미하며, float 타입으로 간주된다.

In [ ]:
import numpy as np

odd = [1, np.nan, 5, 7, 9]
odd = pd.Series(odd)

odd

0    1.0
1    NaN
2    5.0
3    7.0
4    9.0
dtype: float64

# DataFrame

## 생성하기

In [ ]:
# 방법 1
order = [
    ['2017-01-01', 500, 'confirmed'],
    ['2017-01-01', 700, 'confirmed'],
    ['2017-01-01', 200, 'canceled']
]

columns = ['date', 'price', 'state']

order = pd.DataFrame(order, columns = columns)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-01    700  confirmed
2  2017-01-01    200   canceled

In [ ]:
# 방법 2 : 딕셔너리 안에 리스트
order = {
    'date': ['2017-01-01', '2017-01-03', '2017-01-10'],
    'price': [500, 700, 200],
    'state': ['confirmed', 'confirmed', 'canceled']
}

order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

In [ ]:
# 방법 3 : 리스트 안에 딕셔너리
order = [
    {'date': '2017-01-01', 'price': 500, 'state': 'confirmed'},
    {'date': '2017-01-03', 'price': 700, 'state': 'confirmed'},
    {'date': '2017-01-10', 'price': 200, 'state': 'canceled'},
]

order = pd.DataFrame(order)
order

         date  price      state
0  2017-01-01    500  confirmed
1  2017-01-03    700  confirmed
2  2017-01-10    200   canceled

## index / columns / values

In [ ]:
order_url = "https://bit.ly/dsa-01-order"

# order = pd.read_csv(order_url, index_col = 'id')

order = pd.read_csv(order_url)
order = order.set_index('id')

order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [ ]:
type(order.index)

pandas.core.indexes.numeric.Int64Index

In [ ]:
print(order.columns)
order.columns = ['user_id', 'product_id', 'date', 'amount', 'address', 'result']
order.columns

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

Index(['user_id', 'product_id', 'date', 'amount', 'address', 'result'], dtype='object')

In [ ]:
order.values

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

## 기본적인 함수

In [ ]:
order["amount"].describe()

count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: amount, dtype: float64

In [ ]:
order["result"].unique()

array(['confirmed', 'canceled'], dtype=object)

In [ ]:
order["result"].value_counts(normalize = True)

confirmed    0.571429
canceled     0.428571
Name: result, dtype: float64

In [ ]:
order["result"] = order["result"].replace("confirmed", "confirm").replace("canceled", "cancel")

order

    user_id  product_id        date  amount  address   result
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

In [ ]:
order["date"] = pd.to_datetime(order["date"])

order["date"].dt.year
# order["date"].dt.dayofweek

id
1    2017
2    2017
3    2017
4    2017
5    2017
6    2017
7    2017
Name: date, dtype: int64

In [ ]:
order[order["address"].isnull()]

    user_id  product_id       date  amount address  result
id
4         4           2 2017-01-07     500     NaN  cancel
7         2           5 2017-01-10     200     NaN  cancel

In [ ]:
order[~order["address"].isnull()]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [ ]:
order[order["address"].notnull()]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [ ]:
date_candidates = ["2017-01-01", "2017-01-05", "2017-01-09"]

order[order["date"].isin(date_candidates)]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

## 컬럼 추가&수정&삭제

In [ ]:
## 추가&수정
order["order"] = list(range(1,8))
order.loc[order["amount"] >= 500, "VIP"] = "VIP"
order.loc[order["amount"] < 500, "VIP"] = "none-VIP"

order

    user_id  product_id       date  amount  address   result  order       VIP
id
1         3           9 2017-01-01     500    Seoul  confirm      1       VIP
2         1           7 2017-01-03     700    Seoul  confirm      2       VIP
3         3           8 2017-01-03     900  Daejeon  confirm      3       VIP
4         4           2 2017-01-07     500      NaN   cancel      4       VIP
5         7           3 2017-01-09     700  Incheon  confirm      5       VIP
6         5           7 2017-01-09     600    Busan   cancel      6       VIP
7         2           5 2017-01-10     200      NaN   cancel      7  none-VIP

In [ ]:
## 컬럼 삭제
order = order.drop(["order", "VIP"], axis="columns")

order

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [ ]:
## 행 삭제
order = order.drop(3, axis="rows")

order

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

## apply

* 미리 만들어 놓은 함수를 apply 파라미터로 전달하면, 해당 데이터프레임의 컬럼 내 데이터 각각에 for문처럼 적용된다.
* Pandas 가 아닌 Python 문법으로 데이터 조작하려고 할 때 요긴하게 사용 가능하다.

In [ ]:
def is_vip(amount):
  return amount * 100

order["amount"].apply(is_vip)

id
1    50000
2    70000
4    50000
5    70000
6    60000
7    20000
Name: amount, dtype: int64